# InvalidPipeSize Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..PipingFailures..::..InvalidPipeSize Property
BuiltInFailures..::..PipingFailures Class See Also
---
Pipe Size Table "[File Name]" is missing or invalid.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId InvalidPipeSize { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InvalidPipeSize As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ InvalidPipeSize {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..PipingFailures Class
Autodesk.Revit.DB Namespace